//=============================================================================
//
// スコア処理 [cursor.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct tex {
	BOOL					Use;						// TRUE:使っている  FALSE:未使用
	float					w,h;					// 幅と高さ
	XMFLOAT3				Pos;						// ポリゴンの座標
	int						TexNo;					// テクスチャ番号
	};

struct MODE {
	int						use;
	int						cnt;
	int						broken_cnt;
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCursor(void);
void UninitCursor(void);
void UpdateCursor(void);
void DrawCursor(void);
