//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#pragma once

struct SNOW
{
    XMFLOAT3    pos;        // ポリゴンの座標
    float        w, h;        // 幅と高さ
    int            texNo;        // 使用しているテクスチャ番号

    float        scrl;        // スクロール
    XMFLOAT3    old_pos;    // １フレ前のポリゴンの座標
    float        scrl2;        // スクロール
    float        scrl3;        // スクロール
};
//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum {
    MENU_MIN,
    MENU_START,
    MENU_EXIT,
    MENU_MAX,
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);


